# Cameron Holmes
## Week 14 04/21/2022
### Python - Pandas DataFrame - Mapping, Applying, and Grouping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
#mapping
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map ={'Alma': 'Colorado','Brian Head': 'Utah','Fox Park': 'Wyoming', 'Lake Mary': 'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
type(st_map)

dict

In [5]:
df['state'] = df['city'].map(st_map)
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [6]:
#apply
def meter(x):
    return x / 3.2808

In [7]:
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [8]:
df['altitude']=df['altitude'].apply(meter)

In [9]:
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [10]:
df['altitude'] = df['altitude'].apply(lambda x: np.nan if x < 2800 else x)
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park          NaN     Wyoming
3   Lake Mary          NaN  California

In [11]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT','OH','TX','OR'])
df

           b         d         e
UT  0.091363  1.211014 -0.609874
OH -1.261905  0.609059  0.409336
TX -0.347996  1.216298 -1.122587
OR  0.066077 -1.660641 -0.503976

In [12]:
def dif(x):
    return x.max() - x.min()

In [13]:
df.apply(dif)

b    1.353268
d    2.876939
e    1.531923
dtype: float64

In [14]:
df.apply(dif,axis=1)

UT    1.820889
OH    1.870964
TX    2.338885
OR    1.726718
dtype: float64

In [15]:
df

           b         d         e
UT  0.091363  1.211014 -0.609874
OH -1.261905  0.609059  0.409336
TX -0.347996  1.216298 -1.122587
OR  0.066077 -1.660641 -0.503976

In [16]:
df.apply(lambda x: x.max() - x.min())

b    1.353268
d    2.876939
e    1.531923
dtype: float64

In [17]:
df.apply(lambda x: x.max() - x.min(), axis=1)

UT    1.820889
OH    1.870964
TX    2.338885
OR    1.726718
dtype: float64

In [18]:
df.apply(pd.value_counts)

             b    d    e
-1.660641  NaN  1.0  NaN
-1.261905  1.0  NaN  NaN
-1.122587  NaN  NaN  1.0
-0.609874  NaN  NaN  1.0
-0.503976  NaN  NaN  1.0
-0.347996  1.0  NaN  NaN
 0.066077  1.0  NaN  NaN
 0.091363  1.0  NaN  NaN
 0.409336  NaN  NaN  1.0
 0.609059  NaN  1.0  NaN
 1.211014  NaN  1.0  NaN
 1.216298  NaN  1.0  NaN

In [19]:
df.apply(pd.value_counts).fillna(0).astype(int)

           b  d  e
-1.660641  0  1  0
-1.261905  1  0  0
-1.122587  0  0  1
-0.609874  0  0  1
-0.503976  0  0  1
-0.347996  1  0  0
 0.066077  1  0  0
 0.091363  1  0  0
 0.409336  0  0  1
 0.609059  0  1  0
 1.211014  0  1  0
 1.216298  0  1  0

In [20]:
#groupby
df = DataFrame({'k1': ['a','a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})

df

  k1   k2  dataset1  dataset2
0  a  one  0.762630  0.507541
1  a  two  0.776272  0.767078
2  b  one  2.418493  1.483962
3  b  two -0.838100 -0.891164
4  c  one  1.186463  1.157233

In [21]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [22]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [23]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.769451  0.637309
b   0.790196  0.296399
c   1.186463  1.157233

In [24]:
df.groupby('k2').size()

k2
one    3
two    2
dtype: int64

In [25]:
df.groupby('k2').mean()

     dataset1  dataset2
k2
one  1.455862  1.049578
two -0.030914 -0.062043

In [26]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [27]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.762630  0.507541
   two  0.776272  0.767078
b  one  2.418493  1.483962
   two -0.838100 -0.891164
c  one  1.186463  1.157233

In [28]:
df.groupby(['k1','k2']).sum()

        dataset1  dataset2
k1 k2
a  one  0.762630  0.507541
   two  0.776272  0.767078
b  one  2.418493  1.483962
   two -0.838100 -0.891164
c  one  1.186463  1.157233

In [29]:
df.groupby('k1').sum()

    dataset1  dataset2
k1
a   1.538903  1.274619
b   1.580393  0.592797
c   1.186463  1.157233

In [31]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.769451
b    0.790196
c    1.186463
Name: dataset1, dtype: float64

In [32]:
df['dataset1'].groupby(df['k1']).count()

k1
a    2
b    2
c    1
Name: dataset1, dtype: int64

In [33]:
df['dataset1'].groupby(df['k1']).sum()

k1
a    1.538903
b    1.580393
c    1.186463
Name: dataset1, dtype: float64

In [34]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.762630  0.507541
1  a  two  0.776272  0.767078
2  b  one  2.418493  1.483962
3  b  two -0.838100 -0.891164
4  c  one  1.186463  1.157233

In [35]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.769451  0.637309
b   0.790196  0.296399
c   1.186463  1.157233

In [36]:
group = df.groupby(['k1','k2'])
group.count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [37]:
group.sum()

        dataset1  dataset2
k1 k2
a  one  0.762630  0.507541
   two  0.776272  0.767078
b  one  2.418493  1.483962
   two -0.838100 -0.891164
c  one  1.186463  1.157233

In [38]:
group.mean()

        dataset1  dataset2
k1 k2
a  one  0.762630  0.507541
   two  0.776272  0.767078
b  one  2.418493  1.483962
   two -0.838100 -0.891164
c  one  1.186463  1.157233

In [40]:
group.count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [41]:
group = df.groupby(['k1','k2'])[['dataset1']]

In [42]:
group.count()

        dataset1
k1 k2
a  one         1
   two         1
b  one         1
   two         1
c  one         1

In [43]:
group.mean()

        dataset1
k1 k2
a  one  0.762630
   two  0.776272
b  one  2.418493
   two -0.838100
c  one  1.186463

In [45]:
group.sum()

        dataset1
k1 k2
a  one  0.762630
   two  0.776272
b  one  2.418493
   two -0.838100
c  one  1.186463

In [46]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.762630  0.507541
   two  0.776272  0.767078
b  one  2.418493  1.483962
   two -0.838100 -0.891164
c  one  1.186463  1.157233

In [47]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.762630  0.507541
1  a  two  0.776272  0.767078
2  b  one  2.418493  1.483962
3  b  two -0.838100 -0.891164
4  c  one  1.186463  1.157233

In [48]:
df.dtypes

k1           object
k2           object
dataset1    float64
dataset2    float64
dtype: object